ubnt-Alexey-Kuvshinov/stm32projects/LoRaAsset/src/stm32L051x_board.c
	LL_I2C_Disable(I2C1);												//Disable I2C1 prior to modifying configuration registers

			/* I2C SPEEDCLOCK define to max value: Fast Mode @400kHz */
	//		#define I2C_SPEEDCLOCK           400000
	//		#define I2C_DUTYCYCLE            LL_I2C_DUTYCYCLE_2

//		  LL_I2C_ConfigSpeed(I2C1, 16000000, 400000, LL_I2C_DUTYCYCLE_2);	//TODO: configure

		  LL_I2C_Enable(I2C1);

//	SYSCFG->EXTICR[1] |= SYSCFG_EXTICR1_EXTI0_PA;						//Select Port A for EXTI0 line input source
	LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTA, LL_SYSCFG_EXTI_LINE0);//Select Port A for EXTI0 line input source
//	EXTI->RTSR |= EXTI_RTSR_RT0;										//Rising trigger event configuration bit of line 0
	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM0);						//Rising trigger event configuration bit of line 0
//	EXTI->IMR |= EXTI_IMR_IM0;											//enable EXTI0 line interrupt
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM0);								//enable EXTI0 line interrupt
//	EXTI->FTSR |= EXTI_FTSR_FT0;										//Falling trigger event configuration bit of line 0
	NVIC_SetPriority(EXTI0_1_IRQn, GPIO_PRIORITY);						//enable button interrupts in interrupt controller
	NVIC_EnableIRQ(EXTI0_1_IRQn);

	LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTB, LL_SYSCFG_EXTI_LINE2);//Select Port B for EXTI2 line input source
	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM2);						//Rising trigger event configuration bit of line 2
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM2);								//enable EXTI2 line interrupt

	NVIC_SetPriority(EXTI2_3_IRQn, GPIO_PRIORITY);						//enable button interrupts in interrupt controller
	NVIC_EnableIRQ(EXTI2_3_IRQn);
}


void configureUart(USARTx base, uint32_t speed)
{
	USART_ptr(base)->CR1 &=  ~USART_CR1_UE;								//disable UART in order to program
//	USART_ptr(base)->BRR = 0x8A;										//115200 baud from 16MHz HSI, should it be 8B? guess was tried with experimental clocks match
	USART_ptr(base)->BRR = speed;										//baud rate from 16MHz HSI (16MHz / (16 * div), div has last four bits as fractional part expressed in 1/16th)
	USART_ptr(base)->CR1 |= USART_CR1_UESM | USART_CR1_RXNEIE;			//Enable UART in STOP Mode and interrupt on character reception, also used for wake up from Stop Mode
//	USART_ptr(base)->CR3 |= USART_CR3_UCESM;							//Clock Enable in Stop mode *feature removed in 2015
	USART_ptr(base)->CR1 |= USART_CR1_UE | USART_CR1_RE | USART_CR1_TE;	//enable UART, UART receiver and UART transmitter
}

static void inline configureUart1(void)
{
	LL_RCC_SetUSARTClockSource(LL_RCC_USART1_CLKSOURCE_HSI);			//would not wake up from Stop if clock source is not set to HSI
	configurePortPinAsAf(UART1_TX_PORT, UART1_TX_BIT, GPIO_AF_4);	 	//configure UART TX GPIO
	configurePortPinAsAf(UART1_RX_PORT, UART1_RX_BIT, GPIO_AF_4);		//configure UART RX GPIO
	configureUart(USART_1, US_USART_115200);							//configure UART communication parameters 115200
	NVIC_SetPriority(USART1_IRQn, USART_2_PRIORITY);					//enable UART2 interrupt in interrupt controller
	NVIC_EnableIRQ(USART1_IRQn);
}

static void inline configureUart2(void)
{
	LL_RCC_SetUSARTClockSource(LL_RCC_USART2_CLKSOURCE_HSI);
	configurePortPinAsAf(UART2_TX_PORT, UART2_TX_BIT, GPIO_AF_4);		//configure UART TX GPIO
	configurePortPinAsAf(UART2_RX_PORT, UART2_RX_BIT, GPIO_AF_4);		//configure UART RX GPIO
	configureUart(USART_2, US_USART_14400);								//configure UART communication parameters 14400
	NVIC_SetPriority(USART2_IRQn, USART_2_PRIORITY);					//enable UART2 interrupt in interrupt controller
	NVIC_EnableIRQ(USART2_IRQn);
}

static void inline configureLpUart(void)
{
	LL_RCC_SetLPUARTClockSource(LL_RCC_LPUART1_CLKSOURCE_HSI);
	configurePortPinAsAf(LPUART_TX_PORT,LPUART_TX_BIT, GPIO_AF_4);		//configure UART TX GPIO
	configurePortPinAsAf(LPUART_RX_PORT,LPUART_RX_BIT, GPIO_AF_4);		//configure UART RX GPIO
//	configureUart(LPUART, 426667);										//configure LPUART communication parameters 9600
	configureUart(LPUART, US_LPUART_115200);							//configure LPUART communication parameters 115200
	NVIC_SetPriority(LPUART1_IRQn, USART_2_PRIORITY);					//enable LPUART interrupt in interrupt controller
	NVIC_EnableIRQ(LPUART1_IRQn);
}

static void inline configureSpi1(void)
{
	configurePortPinAsAf(RADIO_MOSI_PORT, RADIO_MOSI_BIT, GPIO_AF_0);	//master out slave in GPIO
	configurePortPinAsAf(RADIO_MISO_PORT, RADIO_MISO_BIT, GPIO_AF_0);	//master in slave out GPIO
	configurePortPinAsAf(RADIO_SCK_PORT, RADIO_SCK_BIT, GPIO_AF_0);		//clock GPIO
	configurePortPinPullDown(RADIO_SCK_PORT, RADIO_SCK_BIT);			//pull clock line down for CPOL=0
	setPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);							//deactivate NSS line

	SPI1->CR1 &= ~SPI_CR1_SPE;											//disable SPI1 in order to program
	SPI1->CR1 |= HALF_PERIPHERAL_CLOCK << SPI_CR1_BR_Pos				//8MHz from 16MHz peripheral clock
			 | SPI_CR1_MSTR												//SPI1 will be master
			 | SPI_CR1_SSM												//Software slave management
			 | SPI_CR1_SSI;												//internal slave select to avoid MODF error
	SPI1->CR1 |= SPI_CR1_SPE;											//enable SPI1
}


static inline void enableRTC(void)
{
	LL_PWR_EnableBkUpAccess();											//Enable access to the backup domain
	while(!LL_PWR_IsEnabledBkUpAccess());
	LL_RCC_LSE_Enable();												//Enable LSE
	while(!LL_RCC_LSE_IsReady());										//wait for LSE to become ready
	LL_RCC_SetRTCClockSource(LL_RCC_RTC_CLKSOURCE_LSE);					//set LSE as RTC clock
	LL_RCC_EnableRTC();													//at last, enable RTC

	LL_RTC_DisableWriteProtection(RTC);
//	LL_RTC_EnableShadowRegBypass(RTC);
	LL_RTC_DisableShadowRegBypass(RTC);

	//configure prescalers such that subseconds tick would be 1/1024th of a second i.e. ~1ms
	if((LL_RTC_GetAsynchPrescaler(RTC) != 31) || (LL_RTC_GetSynchPrescaler(RTC) != 1023))
	{
		LL_RTC_EnableInitMode(RTC);
		while(!LL_RTC_IsActiveFlag_INIT(RTC));
		LL_RTC_SetSynchPrescaler(RTC, (uint32_t)1023);					//ck_spre=ck_apre/(SYNC prediv + 1)
		LL_RTC_SetAsynchPrescaler(RTC, (uint32_t)31);					//ck_apre=LSEFreq/(ASYNC prediv + 1) = 1024Hz with LSEFreq=32768Hz
		LL_RTC_DisableInitMode(RTC);
	}

	//RTC alarm A configuration
	LL_RTC_ALMA_Disable(RTC);
	RTC->ISR = ~(RTC_ISR_ALRAF | RTC_ISR_INIT) | (RTC->ISR & RTC_ISR_INIT);	//Clear the AlarmA interrupt pending bit
	while(!LL_RTC_IsActiveFlag_ALRAW(RTC));
	LL_RTC_EnableIT_ALRA(RTC);											//enable Alarm A interrupt
//	LL_RTC_ALMA_Enable(RTC);											//enable Alarm A

	//RTC alarm B configuration
	LL_RTC_ALMB_Disable(RTC);
	RTC->ISR = ~(RTC_ISR_ALRBF | RTC_ISR_INIT) | (RTC->ISR & RTC_ISR_INIT);		//Clear the AlarmB interrupt pending bit
	while(!LL_RTC_IsActiveFlag_ALRBW(RTC));
	LL_RTC_ALMB_SetMask(RTC, RTC_ALRMBR_MSK4 | RTC_ALRMBR_MSK3);		//trigger when minutes, seconds and subseconds match
	LL_RTC_ALMB_SetSubSecondMask(RTC, 10);								//0 - 1023, compare 10 bits of sub second value (1 bit ~= 1ms) for alarm event
	LL_RTC_EnableIT_ALRB(RTC);											//enable Alarm B interrupt
//	LL_RTC_ALMB_Enable(RTC);											//enable Alarm B

//	LL_RTC_EnableWriteProtection(RTC);

	//After a system reset, the software must wait until RSF is set before reading the RTC_SSR RTC_TR and RTC_DR
	while(!LL_RTC_IsActiveFlag_RS(RTC));

	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM17);						//connect RTC Alarm to EXTI line
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM17);

