ubnt-Alexey-Kuvshinov/stm32projects/LoRaAsset/src/stm32L051x_board.c
	NVIC_SetPriority(RTC_IRQn, ALARM_PRIORITY);							//enable RTC Alarms interrupts in interrupt controller
	NVIC_EnableIRQ(RTC_IRQn);
}


static inline void enableLPTim(void)
{
	LL_RCC_SetLPTIMClockSource(LL_RCC_LPTIM1_CLKSOURCE_LSE);			//32.768kHz
	//LL_LPTIM_SetPrescaler(LPTIM1, LL_LPTIM_PRESCALER_DIV32);			//~1ms clock 1/1024s
	LL_LPTIM_SetPrescaler(LPTIM1, LL_LPTIM_PRESCALER_DIV8);
	LL_LPTIM_EnableTimeout(LPTIM1);										//enable wake-up
	LL_LPTIM_EnableIT_CMPM(LPTIM1);										//Enable Compare match interrupt
//LL_LPTIM_EnableIT_ARRM(LPTIM1);

	LL_LPTIM_Enable(LPTIM1);											//Enable LPTIM
	LL_LPTIM_SetAutoReload(LPTIM1, 0xFFFF);								//Load the period value has to be strictly bigger than compare value

	LL_EXTI_EnableIT_0_31(LL_EXTI_LINE_29);
	LL_EXTI_EnableRisingTrig_0_31(LL_EXTI_LINE_29);						//connect LPTIM to EXTI line

	NVIC_SetPriority(LPTIM1_IRQn, LPTIMER_PRIORITY);

	LL_LPTIM_SetAutoReload(LPTIM1, 3);
	LL_LPTIM_SetCompare(LPTIM1,2);
	LL_LPTIM_StartCounter(LPTIM1, LL_LPTIM_OPERATING_MODE_CONTINUOUS);
//while(!LL_LPTIM_IsActiveFlag_CMPOK(LPTIM1));
//	LL_LPTIM_StartCounter(LPTIM1, LL_LPTIM_OPERATING_MODE_ONESHOT);


	NVIC_EnableIRQ(LPTIM1_IRQn);
}


static inline void configureRadio(void)
{
	LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTB, LL_SYSCFG_EXTI_LINE12);//Connect DIO0 pin to EXTI12 line
	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM12);						//configure EXTI12 for rising trigger interrupt
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM12);								//enable line 12 interrupt in EXTI

	LL_SYSCFG_SetEXTISource(LL_SYSCFG_EXTI_PORTB, LL_SYSCFG_EXTI_LINE15);//Connect DIO3 pin to EXTI15 line
	LL_EXTI_EnableRisingTrig_0_31(EXTI_IMR_IM15);						//configure EXTI15 for rising trigger interrupt
	LL_EXTI_EnableIT_0_31(EXTI_IMR_IM15);								//enable line 15 interrupt in EXTI
	NVIC_SetPriority(EXTI4_15_IRQn, GPIO_PRIORITY);						//enable the EXTI lines interrupt in interrupt controller
	NVIC_EnableIRQ(EXTI4_15_IRQn);

	setPortBit(RADIO_RESET_PORT, RADIO_RESET_BIT);						//turn on the radio chip TODO: remove
}

void init_Board_Peripherals(void)
{
	//enable peripherals
	LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOA);					//enable port A
	LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOB);					//enable port B
	LL_IOP_GRP1_EnableClock(LL_IOP_GRP1_PERIPH_GPIOC);					//enable port C
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);				//enable system configuration or writing to SYSCFG has no effect
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1);				//enable UART1 peripheral
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2);				//enable UART2 peripheral
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_LPUART1);				//enable LPUART1 peripheral
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1);					//enable SPI1 peripheral
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_LPTIM1);				//enable low-power timer
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1);					//Enable the peripheral clock for I2C1

	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);					//enable debug interface
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_DBGMCU);
	LL_DBGMCU_EnableDBGStopMode();
	LL_DBGMCU_EnableDBGStandbyMode();
	LL_DBGMCU_ABP1_GRP1_FreezePeriph(LL_DBGMCU_ABP1_GRP1_RTC_STOP | LL_DBGMCU_ABP1_GRP1_LPTIM1_STOP | LL_DBGMCU_ABP1_GRP1_I2C1_STOP);
/**/
	//configure inputs
	for(tmp = 0; tmp < sizeof(inputs) / sizeof(struct GPIO_Line); tmp++)
		configurePortPinAsInput(inputs[tmp].port, inputs[tmp].bit);

	//configure outputs
	setPortBit(RADIO_RESET_PORT, RADIO_RESET_BIT);

	for(tmp = 0; tmp < sizeof(outputs) / sizeof(struct GPIO_Line); tmp++)
		configurePortPinAsOutput(outputs[tmp].port, outputs[tmp].bit);

	configureUart1();													//configure command interface

	configureUart2();													//configure camera interface

	configureLpUart();													//configure GPS interface

	configureSpi1();													//configure radio communication interface

    enableRTC();														//start RTC, clock source is actually set for the first time only, then proper RTC domain reset is needed to change it

	enableLPTim();														//LSE is enabled by enableRTC();

	configureAccelerometer();

//	LL_PWR_EnableWakeUpPin(LL_PWR_WAKEUP_PIN1);				//GSINT1_PORT

	//radio-related configuration
	configureRadio();
}




//Timeout range is from 1 to FFFF 1/1024s => ~ 1ms - 1min, event is the flag to be set when timer expires
void setTimer(uint16_t timeout, uint16_t event)
{
	uint32_t i;
//	uint16_t delta = 0;

	NVIC_DisableIRQ(LPTIM1_IRQn);

	//find a place in scheduling table to insert a new event into
	for(i = 0; i < TIMER_SCHEDULE_SIZE; i++)
		if(timerSchedule[i].event == event)
			break;

	if(TIMER_SCHEDULE_SIZE == i)											//no such event was previously scheduled, find first empty entry for it
		for(i = 0; i < TIMER_SCHEDULE_SIZE; i++)
			if(0 == timerSchedule[i].event)
				break;		  												//empty entry should always exist so skipping check for the end here

	//here we have a position to insert new event into
	timerSchedule[i].event = event;

	//now let's see about the timing
	if (TimerCounter) {														//this means timer is running and counter register must be less than compare register

		if (timeout >= TimerCounter) {
			timerSchedule[i].timeout = timeout - TimerCounter;				//convert the timeout to timer terms
		} else {															//the new event will be first to expire
			timeout = TimerCounter - timeout;								//now use timeout as delta holder, - other scheduled events timeouts need to be increased by this much
			TimerCounter -= timeout;										//schedule the new event with original timout value
			timerSchedule[i].timeout = 0 - timeout;							//to become 0 after following expire time updating loop
			for (i = 0; i < TIMER_SCHEDULE_SIZE; i++)
				timerSchedule[i].timeout += timeout;
		}
	} else {																//scheduling table must be empty, the easy case
		timerSchedule[i].timeout = 0;
		TimerCounter = timeout;
	}

	NVIC_EnableIRQ(LPTIM1_IRQn);
}

/*
//Timeout range is from 2 to 1024 * 60 * 60 - 1 (3 686 399) i.e. 2/1024s - 60 min (timeout of 1/1024 does not trigger)
//event is the flag to be set when timer expires
void setTimer(uint32_t timeout, uint32_t event)
{
	volatile uint32_t minute;
	volatile uint32_t second;
	volatile uint32_t subsecond;
	TimerQueue newEntry;

//	LL_RTC_DisableWriteProtection(RTC);
	LL_RTC_ALMB_Disable(RTC);
//	RTC->ISR = ~(RTC_ISR_ALRBF | RTC_ISR_INIT) | (RTC->ISR & RTC_ISR_INIT);	//Clear the AlarmB interrupt pending bit

	//verify timeout range
	if(timeout > 60 * 60 * 1024 - 1)
		timeout = 60 * 60 * 1024 - 1;
	if(timeout < 2)
		timeout = 2;

