ubnt-Alexey-Kuvshinov/stm32projects/LoRaAsset/src/stm32L051x_board.c
	//calculate RTC values corresponding to current time + timeout
	//	while(!LL_RTC_IsActiveFlag_RS(RTC));							//shadow regs updated
	minute = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_TIME_GetMinute(RTC)) + timeout / (1024 * 60);
	second = __LL_RTC_CONVERT_BCD2BIN(LL_RTC_TIME_GetSecond(RTC)) + (timeout % (1024 * 60)) / 1024;
	subsecond = LL_RTC_TIME_GetSubSecond(RTC);
	(void)LL_RTC_ReadReg(RTC, DR);										//unfreeze time/date registers

	timeout %= 1024;
	if(timeout > subsecond) {
		subsecond = 1024 - timeout + subsecond;
		second++;
	} else
		subsecond -= timeout;

	subsecond = 1024 - subsecond;										//this tricky trick is needed for correct time comparison of TimerQueue.time values, should be reverted back when written to RTC alarm subseconds register

	if(second > 59) {
		second -= 60;
		minute++;
	}

	if(minute > 59)
		minute -= 60;

	//add the event to timer schedule
	newEntry.event = event;
	newEntry.minutes = minute;
	newEntry.seconds = second;
	newEntry.subseconds = subsecond;

	for(uint8tmp = 0; uint8tmp < TIMER_SCHEDULE_SIZE; uint8tmp++)		//if the same event is already scheduled remove it first
		if(event == timerSchedule[uint8tmp].event) {
			memmove(&timerSchedule[uint8tmp], &timerSchedule[uint8tmp + 1], (TIMER_SCHEDULE_SIZE - 1 - uint8tmp) * sizeof(TimerQueue));
			timerSchedule[TIMER_SCHEDULE_SIZE - 1].event = HWE_NO_EVENT;//make sure the last entry is free to use now
			break;
		}

	if(HWE_NO_EVENT != timerSchedule[TIMER_SCHEDULE_SIZE - 1].event)	//now check if scheduling table has room for the new event
		ErrorHandler("Timer is full");									//TODO: this is endless loop, should be changed to device reset

	for(uint8tmp = 0; uint8tmp < TIMER_SCHEDULE_SIZE; uint8tmp++) {		//schedule the new event
	//TODO: implement less than 2 subseconds (including 0) time difference between events, by triggering next event simultaneously
	//	if((HWE_NO_EVENT != timerSchedule[uint8tmp].event) && (abs(timerSchedule[uint8tmp].time - newEntry.time) < 10))
	//		break;

		if((HWE_NO_EVENT == timerSchedule[uint8tmp].event) || (newEntry.time <= timerSchedule[uint8tmp].time)) {
			memmove(&timerSchedule[uint8tmp + 1], &timerSchedule[uint8tmp], (TIMER_SCHEDULE_SIZE - 1 - uint8tmp) * sizeof(TimerQueue));
			timerSchedule[uint8tmp].time = newEntry.time;
			timerSchedule[uint8tmp].event = newEntry.event;
			break;
		}
	}

	//reprogram the alarm if the new event timeout expires first
	if(0 == uint8tmp) {
		while(!LL_RTC_IsActiveFlag_ALRBW(RTC));
		LL_RTC_ALMB_SetSubSecond(RTC, 1024 - subsecond);
		LL_RTC_ALMB_SetSecond(RTC, __LL_RTC_CONVERT_BIN2BCD(second));
		LL_RTC_ALMB_SetMinute(RTC, __LL_RTC_CONVERT_BIN2BCD(minute));
	}

	LL_RTC_ALMB_Enable(RTC);
//	LL_RTC_EnableWriteProtection(RTC);
}




//starts one-shot timer to timeout milliseconds
void startLpTimer(uint16_t timeout)
{
	NVIC_DisableIRQ(LPTIM1_IRQn);
	LL_LPTIM_SetCompare(LPTIM1, timeout);								//Load the Timeout value
	LL_LPTIM_StartCounter(LPTIM1, LL_LPTIM_OPERATING_MODE_ONESHOT);		//LL_LPTIM_OPERATING_MODE_CONTINUOUS
	NVIC_EnableIRQ(LPTIM1_IRQn);
}
*/




void startUart1Msg(uint8_t command)
{
	while(HardwareEvents & HWE_UART1_TRANSMITTING);						//make sure not to screw up a message that may be currently in progress
	Uart1Tx.size = 1;													//reserve space for message length
	Uart1Tx.data[Uart1Tx.size++] = command;
}

void addToUart1Msg(uint8_t byte)
{
	if(Uart1Tx.size >= sizeof(Uart1Tx.data))
		ErrorHandler("addToUart2Msg() error");
	else
		Uart1Tx.data[Uart1Tx.size++] = byte;
}

void sendUart1Message(void)
{
	HardwareEvents |= HWE_UART1_TRANSMITTING;							//uart transmission is in progress
	Uart1Tx.data[0] = Uart1Tx.size;										//number of bytes in a message including first length byte
	Uart1Tx.counter = 0;												//TX buffer should be filled and size properly set
	USART_ptr(USART_1)->CR1 |= USART_CR1_TCIE;							//enable transfer complete interrupt initiating interrupt - driven transmission
}

void uart1SendText(char *text)
{
	while(HardwareEvents & HWE_UART1_TRANSMITTING);
	startUart1Msg(RC_TEXT);

	Uart1Tx.size = strlen(text);
	if(Uart1Tx.size > sizeof(Uart1Tx.data) - 2)
		Uart1Tx.size = sizeof(Uart1Tx.data) - 2;
	memcpy(Uart1Tx.data + 2, text, Uart1Tx.size);
	Uart1Tx.size += 2;
	sendUart1Message();
}

void sendUart2Message(uint8_t *data, uint8_t length)
{
	while(HardwareEvents & HWE_UART2_TRANSMITTING);
	HardwareEvents |= HWE_UART2_TRANSMITTING;							//uart transmission is in progress
	if(length > sizeof(Uart2Tx.data))
		length = sizeof(Uart2Tx.data);
	memmove(Uart2Tx.data, data, length);
	Uart2Tx.size = length;												//number of bytes in a message including first length byte
	Uart2Tx.counter = 0;												//TX buffer should be filled and size properly set
	USART_ptr(USART_2)->CR1 |= USART_CR1_TCIE;							//enable transfer complete interrupt initiating interrupt - driven transmission
}


void spiAccessRegisters(uint8_t *data, uint8_t length)
{
	resetPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);						//start SPI transaction - assert data frame start

	(void)SPI1->DR;														//read and discard RX buffer to clear RXNE, just in case
	while(length--)
	{
		SPI1->DR = *data;												//write a data byte
		while(0 == (SPI1->SR & SPI_SR_RXNE));							//wait until reply is ready
		*(data++) = SPI1->DR;											//save the reply. * Address byte will be overwritten with 0
	}

	setPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);							//end SPI access - deactivate NSS line
}

void spiAccessRegisters2(uint8_t command, uint8_t *data, uint8_t length)
{
	resetPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);						//assert data frame start

	(void)SPI1->DR;														//read and discard RX buffer to clear RXNE, just in case

	SPI1->DR = command;													//send the address with the Write bit indicator
	while(0 == (SPI1->SR & SPI_SR_RXNE));								//wait until address transmits
	(void)SPI1->DR;														//discard dummy return, otherwise next byte returned would be lost

	while(length--)
	{
		SPI1->DR = *data;												//write a data byte
		while(0 == (SPI1->SR & SPI_SR_RXNE));							//wait until reply is ready
		*(data++) = SPI1->DR;											//save the reply
	}

	setPortBit(RADIO_NSS_PORT, RADIO_NSS_BIT);							//deactivate NSS line
}

//TODO: rewrite
//the stop parameter should be zero if i2cRead is called right after i2cWrite, to generate restart condition
void i2cWrite(uint8_t address, uint8_t *data, uint8_t length, uint8_t stop)
{
	LL_I2C_GenerateStartCondition(I2C1);								//Initiate a Start condition to the Slave device

	// LL_I2C_SetSlaveAddr(I2C_TypeDef *I2Cx, uint32_t SlaveAddr)
	//	LL_I2C_SetTransferRequest(I2C_TypeDef *I2Cx, uint32_t TransferRequest)

//	while(!LL_I2C_IsActiveFlag_SB(I2C1));								//wait until Start Bit transmitted (SB flag raised)

	//LL_I2C_HandleTransfer(I2C_TypeDef *I2Cx, uint32_t SlaveAddr, uint32_t SlaveAddrSize,

