ubnt-Alexey-Kuvshinov/stm32projects/LoRaAsset/src/stm32L051x_board.c
	LL_I2C_TransmitData8(I2C1, (address << 1));							//Send Slave address with a 7-Bit SLAVE_OWN_ADDRESS for a write request

	while(!LL_I2C_IsActiveFlag_ADDR(I2C1));								//wait until Address Acknowledgement received (ADDR flag raised)

	LL_I2C_ClearFlag_ADDR(I2C1);										//Clear ADDR flag value in ISR register

	while(length > 0)													//Transmit data
		if(LL_I2C_IsActiveFlag_TXE(I2C1)) {								//Check TXE flag value in ISR register and write next data before previous is transmitted
			LL_I2C_TransmitData8(I2C1, (*data++));						//Write data in Transmit Data register. TXE flag is cleared by writing data in TXDR register
			length--;
		}

	if(stop) {
		while(!LL_I2C_IsActiveFlag_TXE(I2C1));
		LL_I2C_GenerateStopCondition(I2C1);								//Generate Stop condition
	}

}

//TODO: rewrite
void i2cRead(uint8_t address, uint8_t *data, uint8_t length)
{
	LL_I2C_AcknowledgeNextData(I2C1, LL_I2C_ACK);						//Prepare acknowledge for Master data reception

	LL_I2C_GenerateStartCondition(I2C1);								//Initiate a Start condition to the Slave device

//	while(!LL_I2C_IsActiveFlag_SB(I2C1));								//wait until Start Bit transmitted (SB flag raised)

	LL_I2C_TransmitData8(I2C1, (address << 1) | I2C_REQUEST_READ);		//Send Slave address with a 7-Bit SLAVE_OWN_ADDRESS for a write request

	while(!LL_I2C_IsActiveFlag_ADDR(I2C1));								//wait until Address Acknowledgement received (ADDR flag raised)

	if(1 == length)														//for one-byte reception NAK is activated here
		LL_I2C_AcknowledgeNextData(I2C1, LL_I2C_NACK);

	LL_I2C_ClearFlag_ADDR(I2C1);										//Clear ADDR flag value in ISR register

	//here master is in receive mode activated by I2C_REQUEST_READ bit
	while(length > 1)													//receive data
		if(LL_I2C_IsActiveFlag_RXNE(I2C1)) {							//Check RXNE flag value in ISR register and read next data byte
			(*data++) = LL_I2C_ReceiveData8(I2C1);						//Read data in Receive Data register. RXNE flag is cleared by reading data from RXDR register
			length--;
		}


	LL_I2C_AcknowledgeNextData(I2C1, LL_I2C_NACK);						//generate NACK
	LL_I2C_GenerateStopCondition(I2C1);									//and Stop condition after receiving next byte

	while(!LL_I2C_IsActiveFlag_RXNE(I2C1));								//get the last data byte
	*data = LL_I2C_ReceiveData8(I2C1);
}


inline void boardGreenLedOn(void)
{
	setPortBit(AUX_GREEN_LED_PORT, AUX_GREEN_LED_BIT);
}

inline void boardGreenLedOff(void)
{
	resetPortBit(AUX_GREEN_LED_PORT, AUX_GREEN_LED_BIT);
}

void boardGreenLedToggle(void)
{
	if(readPortBit(AUX_GREEN_LED_PORT, AUX_GREEN_LED_BIT))
		boardGreenLedOff();
	else
		boardGreenLedOn();
}

inline void boardWhiteLedOn(void)
{
	setPortBit(AUX_WHITE_LED_PORT, AUX_WHITE_LED_BIT);
}

inline void boardWhiteLedOff(void)
{
	resetPortBit(AUX_WHITE_LED_PORT, AUX_WHITE_LED_BIT);
}

void boardWhiteLedToggle(void)
{
	if(readPortBit(AUX_WHITE_LED_PORT, AUX_WHITE_LED_BIT))
		boardWhiteLedOff();
	else
		boardWhiteLedOn();
}

inline void boardRedLedOn(void)
{
	setPortBit(AUX_RED_LED_PORT, AUX_RED_LED_BIT);
}

inline void boardRedLedOff(void)
{
	resetPortBit(AUX_RED_LED_PORT, AUX_RED_LED_BIT);
}

void boardRedLedToggle(void)
{
	if(readPortBit(AUX_RED_LED_PORT, AUX_RED_LED_BIT))
		boardRedLedOff();
	else
		boardRedLedOn();
}


void driveGreenLed(uint8_t high_low)
{
	if(high_low)
		boardGreenLedOn();
	else
		boardGreenLedOff();
}

void driveRedLed(uint8_t high_low)
{
	if(high_low)
		boardRedLedOn();
	else
		boardRedLedOff();
}

void driveRfSwitch(uint8_t switches)
{
	if(switches & 0b100)												//sets RF output: Low - RFO_HF, High - PA_BOOST
		setPortBit(RF_PA_HIGH_PWR_PORT, RF_PA_HIGH_PWR_BIT);
	else
		resetPortBit(RF_PA_HIGH_PWR_PORT, RF_PA_HIGH_PWR_BIT);

	if(switches & 0b010)
		setPortBit(RF_CPS_PORT, RF_CPS_BIT);							//sets gain control in receive mode: Low - receive low gain, High - receive high gain
	else
		resetPortBit(RF_CPS_PORT, RF_CPS_BIT);

	if(switches & 0b001)												//Shutdown control: Low - turned off, High - RX or TX is enabled
		setPortBit(RF_CSD_PORT, RF_CSD_BIT);
	else
		resetPortBit(RF_CSD_PORT, RF_CSD_BIT);
}


void enterSleep(void)
{
	LL_PWR_ClearFlag_WU();												//ensure that the WUF  wake up flag is cleared
	LL_LPM_EnableDeepSleep();											//Set SLEEPDEEP bit of Cortex System Control Register
	__WFI();															//Request Wait For Interrupt
	//TODO: is it necessary?
//	CLEAR_BIT(SCB->SCR, SCB_SCR_SLEEPDEEP_Msk);							//Reset SLEEPDEEP bit after exiting from Stop
}


void enterStandby(void)
{
	uart1SendText("Bye, going to StandBy");
	while(HardwareEvents & HWE_UART1_TRANSMITTING);						//wait until the message transmits

	LL_PWR_ClearFlag_WU();
	LL_PWR_ClearFlag_SB();
//	LL_PWR_EnableWakeUpPin(LL_PWR_WAKEUP_PIN2);
	LL_PWR_EnableWakeUpPin(LL_PWR_WAKEUP_PIN1);
	LL_LPM_EnableDeepSleep();
	LL_PWR_SetPowerMode(LL_PWR_MODE_STANDBY);

	__SEV();
	__WFE();
	__WFE();
}


//This function is executed in case of error occurrence
void ErrorHandler(char *msg)
{
	boardRedLedOn();
	uart1SendText(msg);
	while(1);
}

#ifdef  USE_FULL_ASSERT
//Reports the name of the source file and the source line number where the assert_param error has occurred
void assert_failed(uint8_t* file, uint32_t line)
{
//User can add his own implementation to report the file name and line number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line)
	while (1);
}
#endif
